[{"title":"Twitter Conversation","description":"Talk to Arnulfo","dateGiven":"2016-10-28","givenBy":"Arnulfo","for":"kfrick@fewaglobal.org","urgency":"normal","_id":"79a816442ab442969c3520e392a47149","started":"yes","dateStarted":"2016-10-31","comments":"Started Conversation. \r\n-------------------------------\r\nProblem: the photos are too big for the slots that are allotted for them.","complete":"complete","dateComplete":"2016-10-31"},{"title":"Test HDD of D025 and try to get it up and running","description":"D025 computer has been having problems of late starting up. From the details explained from Jarrod, it could have to deal with the HDD not working correctly. Take apart the HDD from the computer and run disk de-fragmentation and check it through the BIOS to see if it is properly running. ","dateGiven":"2016-10-31","givenBy":"kfrick@fewaglobal.org","urgency":"normal","_id":"152c8aaa05b24d44a7ed57533c3852fd","started":"yes","dateStarted":"2016-10-31","comments":"Tested the HDD. The test concluded that the HDD was able to play files and copy files over to it. The copying include 1.65GB worth of music that was copied over. The test included playing some of the new data that was copied over. The song played was \"A Horse with No Name\" by America.","complete":"complete","dateComplete":"2016-10-31"},{"title":"Relocate to Saul's old station","description":"clean up and organize computer/desk area","dateGiven":"2016-11-01","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"ad57c0034812467cbf445a44e004a94d","started":"yes","dateStarted":"2016-11-01","comments":"The desk is dirty. Currently going through a stack of paper to see if they are worth keeping or not. ","complete":"complete","dateComplete":"2016-11-01"},{"title":"Label Creation ","description":"Rita and Arnulfo had sent an excel listing sheet of each person's address. Copy those addresses onto a Label form that is easily printed on word. ","dateGiven":"2016-11-01","givenBy":"rromero@fewaglobal.org","urgency":"normal","_id":"541a44a4a4684701b483bd2bdaccc4ca","started":"yes","dateStarted":"2016-11-01","comments":"Currently typing up the labels for the NAJSEP Donors. ","complete":"complete","dateComplete":"2016-11-01"},{"title":"Return Voyager Legend CS","description":"Return to Amazon the Voyager Legend CS","dateGiven":"2016-10-31","givenBy":"jsharp@fewaglobal.org","urgency":"urgent","_id":"60322e3ea3c546a5a75e9b33a7b91368","started":"yes","dateStarted":"2016-10-31","comments":"The Box has been taped closed with all the contents. Currently waiting on UPS to come and pick the item up. The Box is currently located on the front desk with an extra label on top with further instructions. ","complete":"complete","dateComplete":"2016-11-01"},{"title":"Auto Send Alert When Fields are Updated - Due date Thursday","description":"Need to automatically send template: https://na3.salesforce.com/00X50000001AXMj?setupid=EmailTemplates\r\nWhen submitted ETA Field is updated.  \r\nNeed new field in MAP that updates when it is sent (just to confirm it was done) \r\nFor help making changes in live SFE instance - see Jarrod","dateGiven":"2016-11-01","givenBy":"ahinojas@fewaglobal.org","urgency":"urgent","_id":"57175c45237d48e8bcdc109c4e6e3a39","started":"yes","dateStarted":"2016-11-01","comments":"I took a look at the email template. I was not able to receive an email from testing. I tried editing the HTML code to see if there was anything wrong within that but I do not have the correct rights to do so. Currently waiting to talk to Jarrod about this. ","complete":"complete","dateComplete":"2016-11-01"},{"title":"Phone Directory","description":"The dial 0 does not work and the staff directory says dial by last name, or help option that does not work.  ","dateGiven":"2016-11-01","givenBy":"ahinojas@fewaglobal.org","urgency":"normal","_id":"2ae95a7e887144f7b12fee3ea24d7067","started":"yes","dateStarted":"2016-11-01","comments":"Sent an email over to Austin to get the credentials in order to log in. I also asked him for assistance in sorting by something other than the Last Name on the phone directory. I am currently waiting to hear back from him. \r\n\r\nUpdate\r\n-----------\r\nAustin has emailed back with a bit of confusion of the same description given for this task. After speaking with Arnulfo, I have emailed him back with more information on the situation. ","complete":"complete","dateComplete":"2016-11-01"},{"title":"Password Permissions ","description":"Update user group / permissions for passwords and review user groups on server","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"feb5a13154c445c4af370369a331596f","started":"yes","dateStarted":"2016-11-02","comments":"Complete\r\n------------\r\nI went into the sbsvr and added the group DefaultFEWA. The group consists of everyone except Rita, Jarrod, Kyle, Arnulfo, and Scott. Then I went to the passwords folder under IT > properties > Security and added the DefaultFEWA group and denied them of all access. I then took off each individual that is in the DefaultFEWA group out of the security permissions. Users looking to get passwords should contact Rita. ","complete":"complete","dateComplete":"2016-11-02"},{"title":"Scott's Dell QuickLaunch ","description":"Pops up on his office desktop ","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"146097d2fd51485ab4921dfdf12004db","started":"yes","dateStarted":"2016-11-02","comments":"Went to talk to Scott, he said that his quick launch may have been fixed. He will look into it and then contact me back. \r\n----------------------------------------\r\nComplete:\r\nWhile logged in, I went into his System Configuration > Startup and then disabled the Dell and some other applications that would normally activate when logging in. ","complete":"complete","dateComplete":"2016-11-02"},{"title":"Way to share large files with members","description":"Secure file transfer with members outside of size limits in email.  \r\nMaking excel file","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"fd862a24dbf04b2d94fb0931d60fab26","started":"yes","dateStarted":"2016-11-03","comments":"Currently creating an excel spreadsheet with the information that I gathered and stored in a .JSON file. \r\n--------------------\r\nComplete:\r\nCreated an excel spreadsheet and sent it to Jarrod via Spark. ","complete":"complete","dateComplete":"2016-11-03"},{"title":"User Share Folder on Server","description":"Multiple versions, consolidate into one, make  sure no one loses info - move to final location and redirect shortcuts on all desktops as necessary","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"1e18bb3080fd4358b714ba8ed4e4877e","started":"yes","dateStarted":"2016-11-02","comments":"Jaenee, Staggs and Monse had items on the UserShares folder in the sbsvr network. I moved all their files over to User Shares folder and am currently waiting on the go ahead for deleting the UserShares folder. \r\n------------------------------\r\nComplete:\r\nWent onto everyone's PC and put a shortcut onto it to the correct User Shares section. Afterwords, logged into the server and stopped sharing the UserShares folder .","complete":"complete","dateComplete":"2016-11-03"},{"title":"Turn off email attachment saving for new users","description":"","dateGiven":"2016-11-03","givenBy":"ahinojosa@fewaglobal.org","urgency":"urgent","_id":"966703e229cc44be97311fe8ce2ca0b4","started":"yes","dateStarted":"2016-11-03","comments":"I looked up ways to configure adding attachments to the salesforce platform. In the outlook configurations under the desktop administration in the setup menu is the area to do so. \r\n\r\nSetup > Desktop Administration > Outlook Configurations > <name of configuration> > Edit\r\n\r\nYou could do the following in practice:\r\n1. Change the allow users to upload attachments to off\r\nor\r\n2. Add the users that are not currently following that configuration rule set. ","complete":"complete","dateComplete":"2016-11-03"},{"title":"Get Shipping Station Computer Running","description":"Freezing up, non-responsive","dateGiven":"2016-11-01","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"3ddbe99af5c042cebfd0a32b0382a4c4","started":"yes","dateStarted":"2016-11-01","comments":"Power Supply has been bought. Current problems with the computer consists of the power supply not functioning correctly which is causing certain portions of the hardware to not function properly. I tested the harddrive and that works perfectly. The battery comes in Nov. 3rd. Power Supply: EVGA 400 N1, 400W, 2 Yr Warranty\r\n\r\nBattery has come in, repairing now.\r\n----------------------------------------------\r\nComplete:\r\nThe power supply was the problem. The computer booted up immediately and is working perfectly. One possible problem is that the power supply fan is on the bottom and that is currently not venting to the outside. However, if it is like other power supplies, it is intaking air to cool down the power supply and releasing out the back. ","complete":"complete","dateComplete":"2016-11-03"},{"title":"Research Whats APP (sp?)","description":"This is assigned by Scott Evans\r\nApp that gives free texting anywhere in the world for .99 \r\nFacebook bought the app?","dateGiven":"2016-11-03","givenBy":["ahinojosa@fewaglobal.org","jsharp@fewaglobal.org"],"urgency":"normal","_id":"d97975488d304336a4ea221cdb5278e8","started":"yes","dateStarted":"2016-11-03","comments":"What is WhatsApp?\r\nWhatsApp is an application that can be used on the any device that has Wi-Fi capabilities and has the following OS’s: \r\n•\tWindows 8 and higher/Windows Phone\r\n•\tMac OS X\r\n•\tAndriod\r\n•\tiPhone\r\n•\tNokia Symbian\r\n•\tNokia S40\r\n•\tBlackBerry\r\nIt is a messenger service for people that are in different countries or have different country’s cell phone numbers to text back and forth. For example, a child from America cannot normally text a child from Australia because our phone number systems are different. WhatsApp gets rid of that complication.\r\n\r\nPrice: Completely FREE\r\n\r\nFeatures:\r\n•\tTexts: Simple, Reliable Messaging; \r\no\tMessage your friends and family for free*. WhatsApp uses your phone’s Internet connection to send messages so you can avoid SMS fees. *Data rates still apply.\r\n•\tGroup Chat: Groups to Keep in Touch; \r\no\tKeep in touch with the groups of people that matter the most, like your family or coworkers. With group chats, you can share messages, photos and videos with up to 256 people at once. You can also name your group, mute or customize notifications, and more.\r\n•\tWhatsApp on the Web and Desktop: Keep the Conversation Going; \r\no\tWith WhatsApp on the web and desktop, you can seamlessly sync all of your chats to your computer so that you can chat on whatever device is most convenient for you. \r\n•\tWhatsApp Calling: Speak Freely\r\no\tTalk to your friends and family for free*, even if they’re in another country. WhatsApp Calling uses your phone’s Internet connection, instead of your cell plan’s voice minutes, so you don’t have to worry about expensive calling charges. * Data charges may apply.\r\n•\tEnd-to-End Encryption: Security by Default\r\no\tSome of your most personal moments are shared on WhatsApp, which is why we built end-to-end encryption into the latest versions of our app. When end-to-end encrypted, your messages and calls are secured so only you and the person you’re communicating with can read or listen to them, and nobody in between, not even WhatsApp.\r\n•\tPhotos and Videos: Share Moments that Matter\r\no\tSend photos and videos on WhatsApp instantly. You can even capture the moments that matter to you most with a built-in camera. With WhatsApp, photos and videos send quickly even if you’re on a slow connection.\r\n•\tDocuments: Document Sharing Made Easy\r\no\tSend PDFs, documents, spreadsheets, slideshows and more, without the hassle of email or file sharing apps. You can send documents up to 100MB, so it’s easy to get what you need over to who you want. \r\n•\tVoice Messages: Say What’s On Your Mind\r\no\tSometimes, your voice says it all. With just one tap you can record a Voice Message, perfect for a quick hello or a longer story. \r\n","complete":"complete","dateComplete":"2016-11-03"},{"title":"Quickbooks corruption ","description":"Call to Quickbooks - work with Rita to resolve","dateGiven":"2016-11-02","givenBy":"rromero@fewaglobal.org","urgency":"urgent","_id":"86055d123dda452ab62024b2df326a69","started":"yes","dateStarted":"2016-11-04","comments":"Complete:\r\n---------------------\r\nThe corruption had to deal with the backups. When she was backing up there was important non-deletable information in credit card fields for 2 companies. One of the companies, Robert Florest, was easy enough to delete the information in one go, while for the other company, \"Vidal Landscaping Inc\" I had to merge a new customer with the old one with no credit card information in order to fix the problem. \r\n\r\nRamification:\r\n-------------------\r\nVidal Landscaping Inc doesn't have the current shipping or billing information. ","complete":"complete","dateComplete":"2016-11-04"},{"title":"Instant Messenger Service Proposal ","description":"I will create a powerpoint and have a live example of the Discord application compared to Spark. ","dateGiven":"2016-11-02","givenBy":"kfrick@fewaglobal.org","urgency":"normal","_id":"facbb9b5940b4d12ac95361e5dd4a998","started":"yes","dateStarted":"2016-11-07","comments":"I created a powerpoint presentation on why to use Discord over Spark. I will send it over to Jarrod and Arnulfo after some transition work has been done.","complete":"complete","dateComplete":"2016-11-07"},{"title":"Turn on and Update Anti-Virus software","description":"The following computers need an update or to turn on their Anti-Virus software:\r\nD022\r\nD025 - Shipping Computer\r\nD027 - Brandi\r\nD028 - Pam\r\nD030 - Monse\r\nD032 - Conference\r\nD033 - Unknown\r\nD050 - Kyle","dateGiven":"2016-11-03","givenBy":"kfrick@fewaglobal.org","urgency":"urgent","_id":"70b3dede89ae4aff862769ffe3ba062b","started":"yes","dateStarted":"2016-11-04","comments":"The Following computers have been updated and will now check for viruses weekly on Mondays: at 12:10pm:\r\n\r\nD022 - Arnulfo Hinojosa\r\nD025 - Shipping Computer\r\nD027 - Brandi's Computer\r\nD030 - Monse's computer\r\nD032 - Conference Computer\r\nD050 - Kyle's Computer\r\n\r\nPam's Desktop still does not have Trend Micro on it. \r\n\r\nComplete:\r\n---------------------\r\nI had to install a package manager onto my Google Drive and downloaded that to Pam's computer to install it. Everyone's computer except for mysterious computer D033 is working and has a weekly/daily scan on their computers. ","complete":"complete","dateComplete":"2016-11-09"},{"title":"Create a live demo for Google Drive","description":"sharedrive@fewaglobal.org has been set up but some workers may not know how to work Google Drive. Create a live Demo for them to do and show it in front of everyone during the next meeting. ","dateGiven":"2016-11-10","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"504c0ab61c9b4a0c99162c08d82ba5d1","started":"yes","dateStarted":"2016-11-10","complete":"complete","dateComplete":"2016-11-10"},{"title":"Conga H-2B Job Order Form","description":"Work on a template and convert the information from the form onto a conga document","dateGiven":"2016-11-10","dateDue":"2016-11-20","givenBy":"jsharp@fewaglobal.org","urgency":"urgent","_id":"79c61e986bd244ffbe5425c77636860c","started":"yes","dateStarted":"2016-11-11","comments":"After taking a look at the job order form. I have come up with the exact code targets that are needed to be used in a job order form. I for some reason cannot create a word template that is importable into the congamerge that I have access to. \r\n\r\nAfter not being able to test the template that I created it congamerge. I took it upon myself to create a program that would help only the NJ State Job order (since it is the only one that I can manipulate the DOM). It is very unfinished and friendly to those that can understand the file explorer so far. ","complete":"complete","dateComplete":"2016-11-15"},{"title":"Salesforce Winter 2017 Update","description":"Review updates, Attend Webinar, Write Executive Summary - turn in to Jarrod and Arnulfo \nDetailed, extensive look at lightning positive/negative implications","dateGiven":"2016-11-01","givenBy":["ahinojas@fewaglobal.org","jsharp@fewaglobal.org"],"urgency":"normal","_id":"0c0d5637909a4322a1ce1cbb967ba8ac","started":"yes","dateStarted":"2016-11-02","comments":"","complete":"complete","dateComplete":"2016-11-15"},{"title":"IT Diagram","description":"Make sure that we have IT diagram in place,  Either Saul's version or Cisco version.  ","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"b4b7593c25ff4eeea7f65e6eefc7a842","started":"yes","dateStarted":"2016-11-07","comments":"I have started to transfer to the Cisco Packet tracer, however, I think it would be better to wait until Tuesday when we have True Water come down and take a look at our system for free to what they come up with as a diagram. \r\n\r\nUpdate: November 10th 2016\r\n--------------------------------------\r\nCreated a Cisco Packet Tracer verbatim copy of the one Saul had. It so far allows for testing to see if everything is connected correctly. \r\n\r\nUpdate: November 18th, 2016\r\n-----------------------------------------\r\nI created a new version of the IT Diagram that more so represents the It infrastructure that we currently have. There are some limitations on the Cisco Packet Tracer. For example, we have 2, 50 port switches that we use, however, the highest that the Cisco Packet Tracer switches go is 24. \r\nItems that still need to be added are printers. Also when testing on Cisco packet tracer, the connections between the Wireless and wired connections aren't handshaking. ","status":"In-Progress","complete":"complete","dateComplete":"2016-11-28"},{"title":"Find Server Support Company","description":"Review email sent on 11/1/16, contact providers, get quotes to maintain/support server","dateGiven":"2016-11-01","givenBy":"jsharp@fewaglobal.org","urgency":"urgent","_id":"316502240835452d8fb599508b0757e4","started":"yes","dateStarted":"2016-11-01","comments":"After comparing each company without talking to any representative from each company. I have concluded on a ranking system of which company would be the best for us. The list is as follows. 1. True Water, 2. ERGOS, 3. Nousad Hayes, 4. Andridge. \r\n\r\nSome upcoming meetings/phone discussions with the IT companies are as follows:\r\n1. True Water - November 8th from 10am - 11am on site\r\n2. ERGOS - November 2nd from 4pm - 5pm phone call\r\n4. Andridge - November 3rd from 2pm - 3pm phone call\r\n3. Nousad - November 4th  sometime. \r\n\r\nExcel Spreadsheet has been updated with information on ERGOS and Aldridge\r\n\r\nUpdate - Nov. 9th \r\n-------------------------\r\nUpdated the excel spreadsheet with the final company and sent off my final opinion and review off to Jarrod and Arnulfo for their final review.","status":"Waiting on Someone Else","complete":"complete","dateComplete":"2016-11-28"},{"title":"Pam's Home Office Anti Virus Solution","description":"See if we can get trend micro to work remotely; remote scans, etc. ","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"urgent","_id":"3ae9f2a873be4d66b72cca7b9d4ded41","dateDue":"","status":"In-Progress","started":"yes","dateStarted":"2016-12-06","comments":"I went over there and checked on her PC, currently, there is an antivirus that updates automatically and scans automatically on her computer. That subscription will not expire until 8/16/2017. \r\n\r\nI added another anti-virus software to activate when the previous one's subscriptions expire. \r\n\r\nHer Account for BitDefender is:\r\n------------------------------------------\r\nUsername: pevans@fewaglobal.org\r\nPassword: SassyPrincess1","complete":"complete","dateComplete":"2016-12-07","completed":"no"},{"title":"Find where a SurveyGizmo field is populating the information to a H2B case","description":"The question is, \"During your off season how many employees do you anticipate employing (Anyone who recieves a paycheck)?\". Figure out where that question is populating a field in Salesforce and send the information off to Jarrod and Arnulfo.","dateGiven":"2016-12-07","dateDue":"","givenBy":["ahinojosa@fewaglobal.org","jsharp@fewaglobal.org"],"urgency":"normal","_id":"ee30522fce6140a392b48a23398c9004","status":"In-Progress","started":"yes","dateStarted":"2016-12-07","comments":"The question \"During your offseason how many employees do you anticipate employing?\" points to Off Season (double).\r\n\r\nNow Off Season (double) may be a field that is hidden from people. but that is where the question points to. ","complete":"complete","dateComplete":"2016-12-07"},{"title":"Find Salesforce Email Template Branding Document","description":"According to Jarrod Saul should have created a branding template that consists of the branding information for all the salesforce email template that are sent to the members. Find it and send it off to Jarrod for further instructions. ","dateGiven":"2016-12-07","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"1cbdd689eb5f42bbb5fbb9af4b1cdf5e","status":"In-Progress","started":"yes","dateStarted":"2016-12-07","comments":"I've searched through the IT folder and there doesn't seem to be any branding files that relate to the Email Templates for Salesforce. There are, however, tons of email templates that may have been changed over the course of time. \r\n\r\nI went to Jarrod for the next step and he would rather me create a Branding sheet and send it off to him and Arnulfo for later approval and the next step. ","complete":"complete","dateComplete":"2016-12-07"},{"title":"Renew Acronis","description":"Acronis is expiring - see email sent on 11/1/16","dateGiven":"2016-11-01","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"5dfb7204a32e4cd18ec2c69ee23c7418","started":"yes","dateStarted":"2016-11-01","comments":"I've contacted Acronis. They have a new renewal system in which I have to contact a maintenance representative. I've submitted their form; however, I did not know the previous quote. They will respond within one business day. \r\n----------------------------------------------------------------------------\r\nAcronis has replied stating that our contact will be Elisabeth Geers at Connection. She will contact us when she receives our quote. \r\n----------------------------------------------------------------------------\r\nWe received two different invoices for Acronis. One from Acronis themselves and one from Elisabeth Geers. I contacted Elisabeth about it and she is checking with Acronis on which one we should follow. ","status":"Waiting on Someone Else","complete":"complete","dateComplete":"2016-12-07","completed":"no"},{"title":"Recruitment Report - Supplement Documents Email Reminder","description":"In salesforce when the field \"Date Submitted ETA\" goes from \"null\" or \"\" to being filled with a date have a workflow rule send the working guide for the case an email asking for further supplemental documents from the member. ","dateGiven":"2016-12-07","dateDue":"","givenBy":["ahinojosa@fewaglobal.org","bcowan@fewaglobal.org"],"urgency":"normal","_id":"8dc8e878af2b44c791e4a360b57f5c45","status":"In-Progress","started":"yes","dateStarted":"2016-12-07","comments":"Complete:\r\n---------------\r\nThe problem was that the guides wanted to change the field that activated the email. Jarrod and I looked at the field that was activating the email and changed it to Date Submitted ETA not equal to null. ","complete":"complete","dateComplete":"2016-12-08"},{"title":"Create Email Branding Template","description":"Since there isn't a Branding Template, create a new one so that we have consistency throughout all of our email alerts. Send a copy to Jarrod and Arnulfo to be approved once completed.","dateGiven":"2016-12-07","dateDue":"","givenBy":["ahinojosa@fewaglobal.org","jsharp@fewaglobal.org"],"urgency":"normal","_id":"de3df705380c4d22b7faa4c73e5c76d1","status":"In-Progress","started":"yes","dateStarted":"2016-12-07","comments":"I have created a template for the email templates on Salesforce. I will upload the branding template to the NetDrive in the IT folder and other specified locations that Jarrod or Arnulfo requests. ","complete":"complete","dateComplete":"2016-12-08"},{"title":"Update Hardware Inventory List","description":"Find the best program/method to keep track\r\nSee Salesforce Office Supplies object/reports for one way on how it was tracked.\r\nSee password list Users tab for another way it was tracked","dateGiven":"2016-11-09","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"fc2d4a3ee973437bb9d1a345d4e50123","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-05","comments":"The location of the completed Hardware Inventory List is in the Netdrive > IT > Hardware. I still have to ask Jarrod of all the hardware items in his room. Otherwise, everything else is on the Excel Spreadsheet. \r\n\r\n-----------------\r\nThe way the excel spreadsheet is run is that every item is on a separate sheet and then selected onto the full complete sheet with the sheet locations they came from. For the precise location, one must go to the individual sheets and the quantity is also stored on there. \r\n\r\n-------------------\r\nUpdate: 12/7/2016\r\n-------------------\r\nJarrod has taken a look at the excel document. He has stated his willingness to want the document to change and would rather it include some more information. I am currently thinking about doing a redux on the excel spreadsheet because the more I thought about it, the way I have it set up now. Some items on it can be hard to find. \r\n--------------------\r\nUpdate: 12/8/2016\r\n--------------------\r\nI have currently gathered the information for all devices that are in the office that aren't currently being used. I have requested for a late lunch so that I can get to the actual guides offices and record down their devices. \r\nI have finished the Hardware Inventory list and sent it off to Jarrod for approval. ","complete":"complete","dateComplete":"2016-12-12"},{"title":"Lock Invoice","description":"Lock invoice-use conga merge to lock PDF documents and any other sensitive documents that we don't want edited","dateGiven":"2016-11-02","givenBy":["ahinojosa@fewaglobal.org","jsharp@fewaglobal.org","rromero@fewaglobal.org"],"urgency":"normal","_id":"d7f54895c3f04488974aac678ac023c4","started":"yes","dateStarted":"2016-11-14","comments":"I found a way to lock in that the file is outputted a certain way. I will continue to research on how to lock a document so that it is unedited.\r\n\r\nWhat I found so far:\r\n----------------------------\r\nFP0=[0, 1 or 2]\r\nLocks the output file format\r\nIf set to 0, \"Output Format\" is \"Same as template\" and not locked (default)\r\nIf set to 1, \"Output Format\" is \"Adobe Acrobat\" and the Output Format radio buttons are locked.\r\nIf set to 2, “Output Format” is “Same as template” and the Output Format radio buttons are locked\r\n\r\nLocking document are dependent on the type of document that it is. \r\nFor example. A PDF file requires the code PS0=1 to be locked from editing while a Word document required WPD=1 to stop editing. \r\n\r\nMust Do:\r\n-------------\r\nIf changing a PDF to be encrypted, allow for printing by also adding PS1 = 1 otherwise members and guides will not be able to print. \r\n\r\nInformation Locations:\r\n-------------------------------\r\nhttps://support.getconga.com/Conga_Composer/Composer_Parameters/Composer_Parameter_Guide/Output_Parameters\r\nhttps://support.getconga.com/Conga_Composer/Composer_Parameters/Composer_Parameter_Guide","status":"Waiting on Someone Else","complete":"complete","dateComplete":"2016-12-14"},{"title":"H2B Applicant Info Template","description":"When entering the preferred name of the contact, it doesn't come up correctly. Make sure that it comes up by either creating a new formula or figure out why exactly it won't pop up. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"a193f541f5d340048facbf5250c587f3","status":"In-Progress","started":"yes","dateStarted":"2016-12-14","comments":"I went in and deleted the code for the name that was currently in there and replaced it with the same code from the previous email template to this one. \r\n\r\nI then created a fake contact that was tied to the Hinojosa All Stars - TEST account. When I tested the merge fields with the contact and the account, it passed through the preferred name because there was one. And then I tested without a preferred name and the code worked perfectly. \r\n\r\nIf the problem still persists I would say that the information that is being passed to the email template is not the information that the email template is looking for. I had to specifically grab the information that I wanted to make it work. ","complete":"complete","dateComplete":"2016-12-14"},{"title":"Fix Spark File Share","description":"Before Spark crashed, file sharing was possible on spark. It was an easy and convenient way to transfer files from one person to another. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"921d1a607536496190d1354d6b29963c","status":"In-Progress","started":"yes","dateStarted":"2016-12-14","comments":"The Spark file share seems to be working perfectly fine. If any error occurs, it could be due to the size of the file shared because we are only allowed 247.50 MB on Spark each day. \r\n","complete":"complete","dateComplete":"2016-12-14"},{"title":"Mexico Office VPN","description":"Monterrey, Mexico office needs to be able to share folder on server securely - and only have access to that one folder.  They upload signed worker documents into folder and we pull off to send to company.  \r\nDeadline - January 2017","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"urgent","_id":"2c6f463f2a304e5c9f2157e57016b1b5","started":"yes","dateStarted":"2016-11-04","comments":"SBS 2011 comes with a RWA which allows people that are outside the office to access the files. Currently, I have tested on FEWA property and under their own IP to connect and connecting from home. Connecting from their own IP is possible, but connecting from a different location is still impossible. \r\n\r\nI have figured out the open port for which the remote access connects to. I will test this open port when I get off location. \r\n\r\nUpdate:\r\n------------\r\nAfter going home and testing off location at the port :987 it still did not work. Trying to setup a VPN on the Cisco Router. \r\n------------\r\nUpdate: 12/12/2016\r\n--------------------------\r\nAfter ERGOS had helped me restart the VPN and RWA for the company I have gone in and changed Cesar's and Daniel's file share permissions so that they only have access to some folders. I have also created a document to help them log in; currently, the document is in full English. I'm not sure if they are able to speak it fluently. \r\n--------------------------\r\nUpdate: 12/13/2016\r\n--------------------------\r\nCurrently waiting on Jarrod's Approval before notifying Cesar. \r\n\r\nIn changing the access to the folders on the SBSVR, I changed the access from the Everyone Group to the FEWA group. \r\nThe FEWA group only consists of people who are currently employed at the FEWA Bay City facility. If any other person needs access to those folders, then they must be allowed and changed by the SBSadmin or other administrators. ","status":"Waiting on Someone Else","complete":"complete","dateComplete":"2016-12-14"},{"title":"Check to see if Quickbooks is being backed up","description":"Check to see if Quickbooks is being backed up to the server. If it is then great, if it isn't make sure that it is. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"226d0f80decf488daaf7cefe7022fbef","status":"In-Progress","started":"yes","dateStarted":"2016-12-15","comments":"Quickbooks is being backed up twice. It is being backed up to Rita's User Shares drive and then from there it is being backed up on Acronis. ","complete":"complete","dateComplete":"2016-12-15"},{"title":"IT Security","description":"Determine if our security methods are the best security methods to go through currently. If they aren't talk with Ron from ERGOS for more information on becoming more secure.","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"35a69d5d2645400d802f5932a27a6867","status":"In-Progress","started":"yes","dateStarted":"2016-12-15","comments":"From learning experiences, no one can ever be 100% secure, not even the government. If you are on any social platform such as Twitter, Facebook, Tumblr and/or Youtube, your personal information has already been sold off to other companies for use. Granted that most of the companies that they sell off to are Advertising companies, your personal information is still being sold off to the highest bidder. \r\n\r\nSecurity wise, your computer is always being attacked. There are thousands of attacks on your computer per second because of script kids and other \"hackers\" (crackers 'not the racist ones').  Typical Firewall is able to stop the majority of them, but any one that slip by are then determined safe or unsafe by AntiVirus software. Since most antivirus software are on the same status of virus knowledge, crackers are able to create new viruses that become invisible to the antivirus and because of this, Anti-Virus software only stops 15% of attacks that go through the firewall. \r\n\r\nIn order to become the most secure, you must pay thousands of dollars to do so. The best way to think about security is to ask yourself the following question,\r\n\"How much is my information worth to others?\"\r\nOnce you determine the answer, you simply have to make it hard enough for crackers so that they spend more money and resources than the worth of your information. \r\n\r\nI also sent Ron an email asking the same question. \r\nNo response just yet. \r\n\r\nRon emailed back and talked on the phone with me about something that we can do better, but we already do all that he stated. He will want to talk to Jarrod on his next visit about what Jarrod really wants because we are at a disposal at what Windows offers because Jarrod doesn't wish to use another operating system. ","complete":"complete","dateComplete":"2016-12-15"},{"title":"Order Thermometer and HDD","description":"Pam needs an external HDD and the server room needs a new thermometer with humidity checker on it. Get a listing and send it off to Jarrod for approval.","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"308804231a6c46b48b4601191cf84d35","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-14","comments":"Arnulfo also stated that Rita needed a new Scanner so I added the same Scanner on there that both Linda and Jamie have in their offices. \r\n\r\nThe shopping list can be seen here:\r\nhttps://www.amazon.com/gp/registry/wishlist/ref=nav_bnav_wishlist_btn\r\n\r\nWill be waiting on Jarrod approval before buying it all. \r\n\r\n--------------------------\r\nUpdate 12/16/2016\r\n--------------------------\r\nEverything has been ordered. The Scanner and HDD should be here tomorrow or monday, while the Thermometers won't arrive until Jan 10. -  Feb 4.","complete":"complete","dateComplete":"2016-12-15"},{"title":"DR Test Backups","description":"Disaster Recovery testing on all of our backups to see if we can retrieve the data the we are backing up. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"5942fa65fb7f4c51be9dcbfa35d40b98","status":"In-Progress","started":"yes","dateStarted":"2016-12-15","comments":"Depending on the backup you may be able to mount the image. Other backups you are able to go into the backup itself and see the file directory; however, you will need the Acronis software for this. \r\n\r\nThe System Drive backup is a full image backup that is mountable. Just mount it on the Acronis software and from there you are able to go in and see every file in the file directory. \r\n\r\nThe Net Drive and User Share Backups are incremental backups meaning that they are not images, they backup only the new items that are added or the newly modified. In order to obtain the files for this, you would need to go on the file directory to the backup location and keep opening the file until you get to the D: drive and then select the file folder that you wish to get the files. \r\n\r\nI have yet to examine the Exchange backup. Further details will be included. \r\n\r\n-----------------------\r\nUpdate 12/15/2016\r\n-----------------------\r\nI tried to see if I could mount the Exchange backup, but no such luck. Currently in contact with Acronis support for help. \r\n\r\n-----------------------\r\nUpdate 12/15/2016\r\n-----------------------\r\nFrom what Acronis Support has stated, there is not enough memory allocated in order to do an Exchange Recovery. It would need roughly 90GB on the C: drive but the C: drive only has 38GB ready to be used. A possible get around for this is installing a new HDD on the server and move the Exchange information over to that or heavily push onto getting the Office Exchange 365 migration so that the backups will be on the cloud.  \r\n","complete":"complete","dateComplete":"2016-12-15"},{"title":"Partial Cloning in Salesforce","description":"Figure out if Salesforce has it's own Partial cloning. If it does, send all information to Jarrod for further determinations.","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"a8e1ef9ab6b04e54940e5eb9aacaba29","status":"In-Progress","started":"yes","dateStarted":"2016-12-15","comments":"It is technically possible to partially clone in Salesforce; however, it is not possible with the default cloning. In order to partially clone, you could create an application to do so, or create a button that will take and clone  fields with a null expression to it. ","complete":"complete","dateComplete":"2016-12-15"},{"title":"Create a template for Newsletter","description":"Create a Q4 Newsletter with the current information that is given and send a test to Arnulfo for approval. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"ahinojosa@fewaglobal.org","urgency":"normal","_id":"3b2c530e6cc34f79b5634e523464179f","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-14","comments":"I have created a new Q4 newsletter based on objects that were retrievable. I also compared it to the Q1 newsletter that we also had this year. \r\n\r\nName of email: 2016 Q4 Newsletter December\r\n\r\nI have added in the photograph and had to manually resize the picture. \r\n\r\nAdded the President's notes and sent the Test off to Arnulfo. \r\n\r\nHe said that he was working on other documents in Exact Target. ","complete":"complete","dateComplete":"2016-12-16"},{"title":"Compile Data from FY Excel Spreadsheet","description":"Jarrod has given me an Excel spreadsheet of information on the H-2B certification from the Government. He would like me to go through and compile the data. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"605761b4219949a7b764c6c642155e10","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-14","comments":"Update 12/15/2016\r\n-----------------------------\r\nI have compiled and created graphs showing the compiled data. I have compiled data for the entirety of the data and then closely at FEWA data. \r\n\r\nThe following data has been compiled:\r\nFEWA Agent Case Breakdown\r\nFEWA Case by State\r\nFEWA Case Status\r\nLawfirm Cases (excel will start to be unresponsive due to the huge amount of data for this graph)\r\nH-2B Cases by State\r\nCase Status\r\n\r\nI will send the file to Jarrod and wait for further instructions.\r\n\r\n------------------------\r\nUpdate 12/15/2016\r\n------------------------\r\nI have finished a comparison between the top 5 Lawfirms that Jarrod had approved. The following list consists of their names and amount of cases that were filed by them.\r\nMas Labor\t548\r\nF.E.W.A.\t382\r\nPractical Employee Solutions\t238\r\nThe Kershaw Law Firm, Pc\t235\r\nLabor Consultants\t232\r\n\r\nI will send the file to Jarrod for further instructions. \r\n\r\n-------------------------\r\nUpdate 12/16/2016\r\n-------------------------\r\nJarrod had stated that he would like a report done on the information that was gathered. The report had to include the comparisons between our companies and the other top companies, total data charts and information on what the company should focus on in the upcoming seasons.\r\n\r\nI have created the report and sent it off to Jarrod for evaluation.\r\n","complete":"complete","dateComplete":"2016-12-20"},{"title":"Find AC Remote for the Server Room","description":"We used to have a remote for the AC in the Server room, we still might. Look high and low for the device.","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"de641c5e22af42e6bf32c774f5f61f42","status":"In-Progress","started":"yes","dateStarted":"2016-12-15","comments":"I have currently looked at the following locations:\r\nMy desk - nothing\r\nFront Desk - nothing\r\nServer room - nothing\r\nSupply dresser - nothing\r\n\r\nComplete:\r\n-----------------\r\nRemote was found under the UPS battery in the server room. ","complete":"complete","dateComplete":"2016-12-20"},{"title":"Create IF statement for Months Experience","description":"Create an IF statement for Months of Experience Required for the State Job Order form and other forms. ","dateGiven":"2016-12-14","dateDue":"","givenBy":["ahinojosa@fewaglobal.org","jsharp@fewaglobal.org"],"urgency":"normal","_id":"96516022cc0f42eb800edf47b3dc6770","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-14","comments":"I am currently testing my if statement out on Conga Composer. \r\n\r\nMy if statement is:\r\n{IF \"<<H2B_CASE_MONTHS_OF_EXPERIENCE_REQUIRED>>\" = \"\" \"no experience required, will train.\" \"<<H2B_CASE_MONTHS_OF_EXPERIENCE_REQUIRED>> months of experience required.\" }\r\n\r\nI have tested this with Arnulfo All Stars - TEST H2 Case, and it came back as working. \r\nWaiting for further instructions from Jarrod.","complete":"complete","dateComplete":"2016-12-21"},{"title":"Java Program for Folder Manipulation","description":"Create a Java program that can read in an excel spreadsheet and take the names of each person. Take the person information and create a batch file that will then create folders for each person that was passed over to them. ","dateGiven":"2016-12-21","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"df7196c29ccc49859549ec84e9d309e1","status":"In-Progress","started":"yes","dateStarted":"2016-12-21","comments":"I have created a Folder Creator program in Java on the Laptop using Eclipse Neon. The program is OOP designed and uses the collections of ArrayList as its main data transfer. It also uses external JAR files of PUI. \r\n\r\nI have it reading the cell of an excel spreadsheet and if the cell has text greater than 0 in length, it will add that cell's text to the ArrayList. \r\n\r\nThe ArrayList is then passed to another method to create the batch file using a 'for each' loop. \r\n\r\nAll files that are needed to be read and written from the program are located in the workspace/Folder Creator program folder. ","complete":"complete","dateComplete":"2016-12-21"},{"title":"Create instruction to Login to Email Portal","description":"Ayuba and ERGOS has forwarded our email to them and back to us so that if our Exchange services were to go down again, we would still be able to access our email through Reflexion. Create a document/email that has information that will show the others how to login. ","dateGiven":"2016-12-21","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"5ca1ce84291849c8883e6a8dc81b96c7","status":"In-Progress","started":"yes","dateStarted":"2016-12-21","comments":"Created document to follow. Will send to Everyone at 4:25. I have stored a copy of the information in the IT Folder/Emails. \r\n\r\nComplete\r\n------------------","complete":"complete","dateComplete":"2016-12-21"},{"title":"Make FEWA Report FY17 Data ","description":"Arnulfo is wanting a report one page much like the one that he gave me for reference. He would like the data to be the current active H2B case 2017 data. All forms and revisions of the one pager should be sent to him for approval.","dateGiven":"2016-12-22","dateDue":"2017-01-09","givenBy":"ahinojosa@fewaglobal.org","urgency":"urgent","_id":"915bbd9f92d24ccf88fab0a1a3e7ee32","status":"In-Progress","started":"yes","dateStarted":"2016-12-22","comments":"I have created a report that is saved in my personal reports on Salesforce that obtains the information from all H2 cases that are active and fall within the Winter 2016-2017 and Spring 2017 seasons. \r\n\r\nI then took the information that I retrieved from the reports and compiled it down into an easy to read excel document that takes the rather important information. \r\n\r\nFrom there I took the simple information and created Word document that goes over the important information (1 Page).\r\n\r\nI have sent the Word document over to Arnulfo for further review and possible edits. \r\n","complete":"complete","dateComplete":"2016-12-27"},{"title":"Figure out a way to delete fields in an object that are nearing the custom fields amount.","description":"Salesforce allows only a certain amount of fields in a created object. The limit is 500. Come up  with a way to find out which fields are not being used. \r\n\r\n//Comment: Make a program and tally up out of how many instances those fields are being used. \r\n","dateGiven":"2016-11-01","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"7b84f149acc646838ab4be4e2fb60760","started":"yes","dateStarted":"2016-11-02","comments":"I found a free application on the internet for salesforce. It sums up and percentiles the times a field has been used for an object. The user can then go in and delete the field if need be. \r\n\r\nhttps://appexchange.salesforce.com/listingDetail?listingId=a0N30000003HSXEEA4\r\n\r\n--------------------------\r\nUpdate: 12/22/2016\r\n--------------------------\r\nI am not able to install it on the Sandbox nor Regular version for the FEWA salesforce (MAP), but I am able to install and test it on my own Developer Version of Salesforce. So that is what I am going to do first since it is also basically a sandbox.\r\n\r\nAfter testing the application a bit, there are some steps that you would have to do in order for the application to work. \r\nThe items that you need are:\r\n- The object API name.\r\nFirst, go to the tabs page > Field Trip > New Field Trip.\r\nInput the Object API \r\nThen go to the reports tabs and find the folder that says \"Field Trip (Imported Package)\" (This is where your Field Trip reports will show).\r\n\r\n---------------------------\r\nUpdate: 12/28/2016\r\n---------------------------\r\nLeave it until May. Completed Otherwise\r\n","status":"Waiting on Someone Else","complete":"complete","dateComplete":"2016-12-28"},{"title":"Test everything on the Password List","description":"The Password excel spreadsheet list has been worked on by many people and partially sorted. Everything is in disarray, test each password with the given location to see if they work. ","dateGiven":"2016-12-05","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"2e1b19dd920f4ae1b791bff9005a8c47","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-05","comments":"I went in and color coded the password list to show which items still work. \r\nThe entire excel spreadsheet was in disarray. In math, if this excel spreadsheet was a plotted graph, it would be categorized as 'No Correlation'. If I didn't know better, I'd say that the person that worked on this is either a barbarian or has a messed up thinking path. \r\n\r\nColor codes:\r\n----------------\r\nGreen: Works\r\nYellow: Either didn't know where to go to test, or missing information.\r\nRed: Doesn't work.\r\nPurple: Forgotten password but easily changeable. \r\nBlue: Their system wasn't working on their login.\r\n\r\n------------------------\r\nUpdate: 12/8/2016\r\n------------------------\r\nAfter Jarrod had taken a look at the password list, he stated that he would want to look more in-depth with it sometime next week to fully test everything on the list and rid the list of old and outdated information/\r\n------------------------\r\n\r\n-----------------------\r\nUpdate: 12/28/2016\r\n----------------------------\r\nJarrod had said to wait until May to work on this. Complete Otherwise. ","complete":"complete","dateComplete":"2016-12-28"},{"title":"Administrator Processing Template","description":"On December 15th ask Jarrod to go back and approve the contact. If it works correctly make a .pdf template that takes the new information. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"79a5e86a644b44158b5bb61f1742fec9","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-16","comments":"So far I have created a custom button that is called 'Admin Proc' and it is basically an exact copy of Visa Results-NEW. \r\nI added the button to the page layout.\r\nI am working on the template for the button but when I look at the code that I am able to use, there is no data for the Admin Processing Date. \r\n\r\nI have created another Appointment Worker to test the multiplicity of the table. It works and formats correctly. \r\nI have created an IF statement showing the reason for a denied visa if there is a denied visa as well. \r\n\r\nI have gone in and created a CMT template and added in the Report data the date of the Administrator processes. \r\n\r\nWhen the 'Admin Proc' button is pressed, it automatically selects the template to use and cannot be changed. \r\n\r\nAfter testing, everything is populated with information. \r\n--------------------------------\r\nUpdate: 12/21/2016\r\n--------------------------------\r\nJarrod would like for me to try to add an Approved Date Section to the table for template. \r\n\r\nI added the approved Visa Date Section and am now waiting for the approval of the new version compared to the first version.\r\n\r\n--------------------------------\r\nUpdate: 12/28/2016\r\n--------------------------------\r\nThe new form has been approved and I have uploaded and attached it to the CMT.","complete":"complete","dateComplete":"2016-12-28"},{"title":"Compare other versions of Salesforce","description":"Compare Ultimate and Performance versions of Salesforce to ours and give the report off to Jarrod.","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"a6b79ad6c3c64f499637b9ab1769128b","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-16","comments":"I did my best creating my own comparison table of the Salesforce editions, but Salesforce had their own more in-depth comparison. \r\n\r\nI will send both over to Jarrod and wait for further instructions.\r\n\r\nJarrod is looking more for information on upgrading our Field and storage limitations.  \r\n\r\n----------------------------\r\nUpdate: 12/23/2016\r\n----------------------------\r\nI am not able to access the store.salesforce.com maybe due to the lack of permissions for my Salesforce account. I will relay this information to Jarrod in our next meeting. ","complete":"complete","dateComplete":"2017-01-04"},{"title":"Add Company name and Residence to Excel Spreadsheet","description":"On the custom link Send GAL - NEW on an account page in Salesforce we want to add in the Account's name and another column that shows the workers country of residence or consulate. ","dateGiven":"2017-01-04","dateDue":"","givenBy":"ahinojosa@fewaglobal.org","urgency":"normal","_id":"7c91b54f198d4fa3ae3b0a16cc331472","status":"In-Progress","started":"yes","dateStarted":"2017-01-04","comments":"I have modified the current excel spreadsheet that merges the information for the Send GAL - NEW on the Account. It now has the Account name and another column that shows the information for each worker's country of residence. ","complete":"complete","dateComplete":"2017-01-04"},{"title":"Make a Schedule of School Timing","description":"Your schooling schedule is needed to make sure that the company knows when to start looking to hire someone else. The company is also wanting some overlap between you and the new IT person so that when you leave, they have a well understanding of everything that is going on. Make a schedule of when everything will be out so that we can have a better understanding of when everything should take place. ","dateGiven":"2017-01-04","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"408e2e387132457eaf04860a1b463f68","status":"In-Progress","started":"yes","dateStarted":"2017-01-04","comments":"I have created a school schedule projection document that contains the information for when I applied, and application deadlines and a projected decision date. ","complete":"complete","dateComplete":"2017-01-04"},{"title":"Update DYMO Software","description":"DYMO is updating their software with the newest update and it is a mandatory update that requires all users to update in order to keep using the software due to currency changes. During lunch one day, go around everyone's computer and make sure that if they have the software, update it to the newest version.","dateGiven":"2016-12-28","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"f21cb3b2ed044acea127d0efd8c2e0c0","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-30","comments":"DYMO Software has been updated on the shipping computer.\r\n\r\nRita does not have the software on her computer. \r\n\r\n-------------------------------\r\nUpdate: 1/13/2017\r\n-------------------------------\r\nSince Rita was the only person to come to me asking the program. I installed it on her computer and will be doing monthly updates to it when needed. I will be using the shipping computer as a reference for updates.","complete":"complete","dateComplete":"2017-01-13"},{"title":"Rita's Connection","description":"Right now on wireless because LAN not working properly after RM install. \r\nPending Invoice resolution -  RM invoiced for tech to come out and check the problem line THEY installed.","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"8697f09c9f3a444cac2ff82543b034c8","started":"yes","dateStarted":"2016-11-07","comments":"Arnulfo said to find another company to run a new line and test it properly.  -JS 11/17/16\r\n\r\nTesting a Wifi USB card on the computer to test to see if she can access the wifi that we have established in the office. \r\n\r\n1st Try:\r\n---------------\r\nWhat I did was install the driver for my WiFi card that I plugged into USB slot 05 in the front. Then I disabled her internal Wireless card, \"Dell Wireless 1801 801.11 nbg\". I also unplugged the wireless bridge in her room. If there are any internet problems she is to contact me so I can re-enable her card and plug the bridge back in but I want to see if it can last one day if it can then we can hand back the bridge.\r\n---------------------\r\nUpdate 12/7/2016\r\n---------------------\r\nI emailed Austin Crow about the problem to see if he can send me the contact information that his company had used. He gave me Crystal's information and I have sent her an email. So far no response. \r\n-----------------------------\r\nUpdate: 12/14/2016\r\n-----------------------------\r\nAmber has responded with an Invoice on the wire installation. The invoice has been forwarded to Jarrod and further instructions away. \r\n\r\n----------------------------\r\nUpdate: 12/22/2016\r\n----------------------------\r\nI signed the invoice that Jarrod had approved and sent it back to Amber. I believe that she will be in touch for when the rewiring will be done.\r\n\r\n----------------------------\r\nUpdate: 12/28/2016\r\n----------------------------\r\nI have been assigned a work number and will be in contact with someone from Datavox to fulfill the rewiring. \r\n\r\n----------------------------\r\nUpdate: 1/5/2017\r\n----------------------------\r\nEstrada Edgar from Datavox's wiring company came down and rewired Rita's room. She now has two different ports in her room since the inability to move her desk, but the one outside the desk is the working one. I have ran a speed test on her computer and currently she is at the standard of the rest of the company with 50MB/s download and 5MB/s upload.\r\n\r\nThe rewiring did not work out. So there might be something wrong with her computer, and if there is, then I will have to redownload the drivers to her computer since there is nothing wrong with the hardware not being correctly fitted.\r\n\r\n--------------------------------\r\nUpdate: 1/6/2017\r\n--------------------------------\r\nI have tested the wired connections that are in Rita's room by pinging google 500 times on each one and there was no disconnection during the 500packets for the ping. This concludes that there is nothing wrong with the switch configurations, nor is there something wrong with the wiring jobs. Instead this concludes that the issue is with Rita's Station itself. I have gone in and uninstalled all drivers that deal with the ethernet and then reinstalled them to see if they were poorly installed or corrupted when the station was setback from Windows 10 to Windows 7. I also disabled her WiFi connection as a test phase. For today and for two more business days I will be asking her at regular intervals for an internet update. If anything is bad, it will mean that the computer will have to be sent back and get a replacement one. \r\n\r\nIssue:\r\n---------\r\nRita's office is a complete dead spot for wireless connectivity. Anywhere else is this building, there is a complete stream of at least 10Mb/s except for Pam's office which only had 5Mb/s. I cannot conclude on any actual problem that is hardware issues with our current router/wireless router. ","complete":"complete","dateComplete":"2017-01-13","status":"Waiting on Someone Else","completed":"no"},{"title":"Partial Clone H2 Cases","description":"H2 Cases in Salesforce that haven't been completed have to be recreated due to the cap being reached. Partial clone those cases (sheet given) and make the new start date to 4/1/2017","dateGiven":"2017-01-13","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"urgent","_id":"f2e63c261f854972a25c2b530ccda9ed","status":"In-Progress","started":"yes","dateStarted":"2017-01-13","comments":"I have finished partial cloning of each case that was on the sheet given to me. \r\n\r\nI do have to state that the way of partial cloning seems to be poorly designed. For instance the lack of information that is able to be cloned as well as the incorrect pointers between the two programs. I'd suggest correcting out these pointers and adding more information to the partial clone to make it easier for later partial cloning. ","complete":"complete","dateComplete":"2017-01-13"},{"title":"H2A Statistics Report","description":"Create a report much like the one that you created for H2B statistics. ","dateGiven":"2016-12-21","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"eb4f0519cdef47eda342374e95faf6ff","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-27","comments":"I have taken the information that Jarrod had sent over to me and compiled it down into a quick and easy report to read with graph comparing our data with the top 4 lawfirms from the data. \r\n\r\nI have created a report from the data that compiled and sent it off to Jarrod for further instructions. \r\n","complete":"complete","dateComplete":"2017-01-25"},{"title":"Report for Scott","description":"Create a report on the H2 Cases that are affected do to the cap being reached. Categorize by State, Start Date, Job description and how many workers that the companies had requested. Hand in final version to Scott. ","dateGiven":"2017-01-13","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"5411e335567749c4b1030e5167fd504a","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-01-13","comments":"Created the report and stats sheet in Office. Sent the end products to Jarrod and currently waiting for further response. \r\n\r\n","complete":"complete","dateComplete":"2017-01-25"},{"title":"Play around with Other Server","description":"We have another server in the back just sitting there doing nothing. Get into it and see what can be done with it if anything . Possibly try to mount the Exchange Backup on there. ","dateGiven":"2016-12-21","dateDue":"","givenBy":"kfrick@fewaglobal.org","urgency":"normal","_id":"94765252946d4114bd58c183f77ce2c0","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-21","comments":"I brought the other server up, it runs perfectly fine, but installed on it is VMWare and there are no clear passwords or administrator that has been documented anywhere. So currently unless the device is wiped, it is a sitting brick because the only person who knows anything on the server would be Saul.\r\n\r\n----------------------------\r\nUpdate: 12/28/2016\r\n-----------------------------\r\nJarrod has stated to wait until Ron visits again to see what we should do with the extra server.","complete":"complete","dateComplete":"2017-01-25"},{"title":"Zenkraft App ","description":"Keep an eye out for the Zenkraft meeting online. ","dateGiven":"2017-01-17","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"0aa884fa3fd14c66a8a7cfd0a41889e0","status":"In-Progress","started":"yes","dateStarted":"2017-01-24","comments":"After watching the video on their new application, it doesn't seem likely to add it onto our Salesforce. The new app platform deals more with mail carriers that we don't use. The new application does not have support from mail carriers such as FedEx and UPS. ","complete":"complete","dateComplete":"2017-01-25"},{"title":"Save AV certificate in IT Folder","description":"Want backups","dateGiven":"2017-01-25","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"a1d99839f0234a8fae91b0e4b0f64794","status":"In-Progress","started":"yes","dateStarted":"2017-01-30","comments":"I found the certificate in the email and saved it under the following folder: \r\n\r\nNET Drive\\FEWA\\IT\\Certificates","complete":"complete","dateComplete":"2017-01-30"},{"title":"Road Map for IT","description":"Some applications go out of existence. With our current technology in house, create a timeline that will show the possible ending dates for everything that we use. Such things could be when Windows will drop support for their applications.","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"d313f0e44bcc45c28ab5c9f94fd2f6eb","status":"In-Progress","started":"yes","dateStarted":"2016-12-16","comments":"I created a Powerpoint document that contains a timeline of all the items that will be going on in the next 5 years. (2020) \r\n\r\nIt isn't plentiful in information because most of the information is stored on an excel spreadsheet which is indicated in the document. \r\n\r\nSupport for Windows 7 and SBS 2011 drop roughly the same time; however updates for SBS 2011 and Full-time support have already been dropped from Microsoft. \r\n\r\nRenewals for software are in the renewals folder in the IT Net Drive folder. \r\n\r\nMost, if not all, warranties have expired. Undocumented warranties may be the only warranties that are still active. \r\n\r\nI will add more information if I find any more on research. ","complete":"complete","dateComplete":"2017-01-31"},{"title":"Contact Austin Crow about phone problems","description":"When speaking on speakerphone on our phone systems, there seems to be some interference. Contact Austin to see if there is a fix to this interference. ","dateGiven":"2017-01-04","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"0fb07c86dd93455eb09e76c420391275","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-01-04","comments":"I have sent Austin an email describing our problems and am currently waiting for a response. \r\n\r\n\r\n---------------------------\r\nUpdate: 1/5/2017\r\n---------------------------\r\nAustin had stated that he doesn't think that we have a problem with our phones. He says it would be our phone provider and to contact them. He did say before doing so that I should test out the phone system by calling extension to extension to see if there is any interference. \r\n\r\n---------------------------\r\nUpdate: 1/6/2017\r\n---------------------------\r\nRonda and I tested the phone system by calling extension-to-extension through speaker phone and there was no interference at all between us, so, therefore, the problem has to do with our provider. I will be in contact with the provider during the next billing statement since we are currently in the process of switching between companies that deal with AT&T services. \r\n\r\n--------------------------\r\nUpdate: 2/1/2017\r\n--------------------------\r\nI have emailed Austin regarding more questions based around the update to the PRI phone system in which we are going to be getting direct lines. These questions had to deal with transferring phone calls, the main 7577 number and the deal with our Fax machines. \r\n\r\n-----------------------------\r\nUpdate: 2/7/2017\r\n-----------------------------\r\nPhone systems were updated to the new PRI and after some complications with the W.O. Machine, everything is now running smoothly. I had a long converstion on the phone through normal phone headphone, external headphones and also through speakerphone and not a single time was there interference between us. \r\n\r\n","complete":"complete","dateComplete":"2017-02-07"},{"title":"Contact ERGOS","description":"Ergos has given a price for the internet changeover. Contact them about perhaps waiting until end-season to switch.","dateGiven":"2017-02-07","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"08df710d1f0e4d048280108d9671cd8d","status":"In-Progress","started":"yes","dateStarted":"2017-02-07","comments":"I sent an email to Ron Worrel that we will be holding off until end-season to do the switch. Also that we may do both switchings together at once. (Exchange and Internet) ","complete":"complete","dateComplete":"2017-02-07"},{"title":"SalesForce Web-To-Lead","description":"Check to see if we still have a web-to-lead and if so change it so that it conforms to new Salesforce update rules. ","dateGiven":"2017-02-07","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"8f90c07434084518a03c662dfa3cc1db","status":"In-Progress","started":"yes","dateStarted":"2017-02-07","comments":"We do have a web-to-lead connection on our Contact Us page from fewaglobal.org. It can be updated or it can be deleted overall. I have asked Jarrod for his decision on it and will wait until further instructions have been given.\r\n\r\n----------------------\r\nUpdate: 2/8/2017\r\n-----------------------\r\nI got approved to change the website to fit the new updated version of Web-To-Lead. I changed the .php page by ridding the added javascript for checking if fields had anything included in them because it did not work anymore and it is an outdated way to check required fields. Then I added the new updated form for the Web-to-Lead, but since it did not have any front-end changes, I put it in a nice form fitting table to make it look aesthetically pleasing to the eyes. ","complete":"complete","dateComplete":"2017-02-08"},{"title":"Check new Server Software","description":"Check new versions of Small Business Server (Server Essentials) to see if they come with Sharepoint. If they do great, and if they don't come up with a better way to have our information stored. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"kfrick@fewaglobal.org","urgency":"normal","_id":"a7566d0076414202a5400a1ad1e86ddf","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-15","comments":"Windows Server 2012 R2 Essentials and Windows Server 2016 do not come with Sharepoint automatically, but they can be downloaded as a Software as a Service (SaaS) separately and added onto the server. \r\n\r\nIf we were going to upgrade I would suggest upgrading to Windows Server 2016 because it's OS is based on Windows 10 while Windows Server 2012 R2 is based on the hated Windows 8 and 8.1. \r\n\r\nAlso the billing on Windows Server 2016 is based on the CPU cores rather than CPU sockets. Meaning that it is billed based on how much CPU is on the server rather how much can be on the server. \r\n\r\nI'd also recommend that if we were going to change over the Server Software that we should get in contact with ERGOS about the transition and see if they can help in anyway possible. ","complete":"complete","dateComplete":"2017-02-09"},{"title":"Salesforce Flows","description":"After seeing the creation of a simple flow. Let's see if it can do more difficult things such as cross object handshaking. If it can, keep testing things out with the flow to see what it can do. ","dateGiven":"2017-01-13","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"766f47cf8a114b44847d6a06c18ffba4","status":"In-Progress","started":"yes","dateStarted":"2017-01-16","comments":"Update: 1/16/2017\r\n-----------------------------\r\nCurrently working on creating a petition in a flow. Afterwards will be handshaking between the two objects (petitions, H2 Case).\r\n\r\nHandshaking currently works in the Flow system but again I tried to make a flow that can be interrupted, but that current flow systems cannot deal with a wait function. Also the other flow systems either have to be done through third party apps or through APEX code. \r\n\r\n-----------------------------\r\nUpdate: 2/9/2017\r\n----------------------------\r\nFlows are able to be linked to pages through WEB URL connections from buttons and page links that are created. Flows are getting a CSS update in Spring '17 update because they are migrating over to be native in Lightning. I don't believe that flows should be utilized for members who are used to our Salesforce environment currently. I see this as only a good thing for new-hires trying to go through the process for their first or second time. ","complete":"complete","dateComplete":"2017-02-09"},{"title":"Look at Changes to Conga Composer","description":"There has been an update in which Conga Composer is splitting into Conga Enterprise and Conga Business. Read the update and come up with how it pertains to us. ","dateGiven":"2017-01-31","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"1da14326fdb7468596f3b556682de891","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-01-31","comments":"I have contacted Conga support for further details on business and enterprise editions. They are contacting our account owner and will be contacting me back. \r\n\r\n------------------------\r\nUpdate: 2/13/2017\r\n------------------------\r\nEric Visser has finally gotten back to me on the additions that Enterprise has. They are as follows:\r\n- Integration with Cloud Security Provider (CASB)\r\n   - Integration for 3rd party data encryptions CipherCloud and Perspecsys\r\n-Custom Branding of Composer's Interface \r\n   - Custom brand the composer Interface with your logo to increase brand consistency and awareness\r\n- API \r\n   - Retrieve templates from any non-Salesforce application; Create your own interface instead of downloading the Composer Application \r\n- External Data\r\n   - Merge documents from multiple Salesforce orgs or external databases such as an ERP, homegrown database and more.\r\n\r\nFrom those additions, I do not believe it is worth the upgrade to Enterprise Edition","complete":"complete","dateComplete":"2017-02-13"},{"title":"Update Merge Forms","description":"You will need to work with Monse on updating the merged forms that will change.  Just add it to your list and we can talk about in our next meeting.","dateGiven":"2017-02-10","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"fca29f9b9f444c88858199bb528bc46e","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-02-13","comments":"Monse has given me two different I-129 forms. One is the old version that we used to use and the other is the newer form that we are switching to. \r\n\r\nI have gone through on Adobe Acrobat and created Merge fields to merge information from Salesforce onto the PDF form. I have tested it multiple times while looking over how the old I-129 form was done. I have sent it off to Monse for further investigating any changes that will have to be made to it. \r\n\r\n-------------------------------\r\nUpdate: 2/20/2017\r\n-------------------------------\r\nArnulfo has gone over the I-129 and has come back with some edits. I have changed the I-129 form to fit the edits for him. I have uploaded the form to Salesforce for production use. It has been renamed to I-129 Rev 2017.","complete":"complete","dateComplete":"2017-02-20"},{"title":"Salesforce Appointment Buttons","description":"Cesar wants two new buttons added to the Appointments object. These buttons are much like the Reporta Consulado - F/R button. Separate the F and the R into their own buttons. ","dateGiven":"2017-02-21","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"256a2cac11404ed181a831df60841c5a","status":"In-Progress","started":"yes","dateStarted":"2017-02-21","comments":"I have created two new buttons, reports, and CongaMerge Templates in order to fit the accommodations of the new buttons. \r\n\r\nThe new templates are for the Return Workers and First Time Workers and they both have their own Reports that filter through the First Time / Returning workers field by selecting either R or F respectively. \r\n\r\nThe templates are rather the same as the original Reporta button, but they pertain more towards their sections. ","complete":"complete","dateComplete":"2017-02-21"},{"title":"Find Information","description":"Find the licenses, username and password to the current Adobe Products and Accounts and store the information on the password list. ","dateGiven":"2017-02-21","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"fdb74a4eb037404087ad98f48dad455e","status":"In-Progress","started":"yes","dateStarted":"2017-02-22","comments":"I found the licensing under the mixed documents folder. It contains the renewal time. I also found some conversations between Saul and the Adobe representative. It seems that the licensing is annually renewed and is bundled altogether in a team distribution. This seems to be a lot like the way Office 365 is done. Still looking for any login information. \r\n\r\nI have found the login information to be from Saul's Account. I reset the password and have updated the password list with the new password. It is a team distribution meaning that licensing is assigned to emails and not to individual stations. All licenses can be viewed from logging into the account and going to My Team.","complete":"complete","dateComplete":"2017-02-22"},{"title":"Clean up Printing Networks","description":"There are some printers on the printing network of the SBSVR that aren't used anymore. Figure out which ones aren't used and rid them from the network. ","dateGiven":"2017-02-22","dateDue":"","givenBy":"ahinojosa@fewaglobal.org","urgency":"normal","_id":"f480c10b79504addb7bed794d5bc083b","status":"In-Progress","started":"yes","dateStarted":"2017-02-22","comments":"There were six printers in all that were connected to the network:\r\nDell Shipping Area Printer\r\nDell Main Office\r\nHP Shipping Area Printer\r\nHallway Printer\r\nZebra ZP 500 (ZPL)\r\nDYMO LabelWriter Twin Turbo\r\n\r\nThe only one that isn't used anymore is the HP Shipping Area Printer. Therefore, I rid it of the network. \r\n\r\nAll other printers on machines would be physical printers connected to their computers or left over drivers that are installed on the computer. The way to fix this would be to delete said drivers from the machine. ","complete":"complete","dateComplete":"2017-02-22"},{"title":"Backups not Going through.","description":"Backups were not going through, so I started to end the processes but some take longer than others. Once they are done stopping, restart them and make the backups start running again. ","dateGiven":"2017-03-15","dateDue":"","givenBy":"kfrick@fewaglobal.org","urgency":"urgent","_id":"79842cc1690c447898e7603960f6b6e4","status":"In-Progress","started":"yes","dateStarted":"2017-03-15","comments":"I restarted all the services and restarted the Acronis software. The backups are now going through.\r\n","complete":"complete","dateComplete":"2017-03-31","completed":"no"},{"title":"Flash Memory Passwords","description":"Flash memory USB drives can have passwords on them to protect the data, figure out how to do this and give instructions to Jarrod.","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"857b7df4a0db4fceada79203a073fa99","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-15","comments":"There are multiple ways to create passwords on a flash drive, however, there is no casual way for non-programmers and cheapskates. \r\n\r\nHere are a couple of different ways:\r\n1. You can hide the file from everyone and create a .bat file that is asks for a password and then if the password is correct opens the folder files.\r\n2. You can download Rohos Mini Drive (free version only for 8GB flash Drive) and move that over to the drive with a password on it.\r\n3. You can manually edit the files to be password protected (granted that the files are able to)\r\n4. You can use USB Safeguard (free version only for 2GB flash drives) and drag it over to the USB and add a password to it.\r\n5. Use DiskCryptor (free service) but in order to view the USB the recipient would also have to use DiskCryptor to decrypt it\r\n\r\nAwaiting Jarrod's Decision\r\n\r\n--------------------------\r\nUpdate: 12/22/2016\r\n--------------------------\r\nI asked Arnulfo for the information of the company that we get the USBs from. I have asked them to see if they can make password protected USBs. They said that they are able to, but only for Windows users. I do not know how many of our members use Macs, but Apple products are highly popular, yet expensive.\r\n\r\nI will send over this information to Jarrod to see what he would like to do with the USBs. \r\n\r\n--------------------------\r\nUpdate: 12/28/2016\r\n--------------------------\r\n\r\nJarrod would rather that him and I talk to Arnulfo about it on Monday, January 16th. \r\n\r\n\r\n\r\n---------------------------\r\nUpdate 1/5/2017\r\n---------------------------\r\nJarrod had told me to create a comparison between the two and send it off to Arnulfo. I did as he asked comparing the cost of what it would be if we ordered password created USBs or manpower operated the passwords with an external program. \r\n\r\nI also asked Katherine a couple more questions on the USBs and she is sending one to test to the current location. \r\n\r\n---------------------\r\nUpdate: 3/6/2017\r\n-----------------------\r\nArnulfo has taken a look at the password protected USB. After testing a bit, it seemed that he enjoyed the idea of having promodealer putting the passwords on themselves since it is an extra $.13 per device. \r\n\r\nOrders will be placed at a later time. \r\n\r\n-------------------------------\r\nUpdate: 4/10/2017\r\n-------------------------------\r\nUSBs have just been ordered. They will arrive in 10 business days and all of them have the password of '2017'. \r\n\r\n----------------------------\r\nSources:\r\n----\r\nhttp://www.makeuseof.com/tag/how-to-password-protect-your-usb-stick-3-easy-ways/\r\nhttps://www.youtube.com/watch?v=GOeLmr94i5I","complete":"complete","dateComplete":"2017-04-10"},{"title":"Remote Access Problems","description":"Remote Access accounts on Salesforce are having a problem with the verification codes. Find a way to tone down the security needed on those accounts so that there is no need for a verification during every log in. ","dateGiven":"2017-02-21","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"eaf55eda865740668c12a618be0640ca","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-02-21","comments":"https://resources.docs.salesforce.com/204/latest/en-us/sfdc/pdf/salesforce_security_impl_guide.pdf\r\n\r\n-------------------------\r\nUpdate: 2/22/2017\r\n-------------------------\r\nI looked at the login history of the remoteoffice and they are still logging in from Internet Explorer 7 & 8 from their computers. With recent updates to Salesforce, Internet Explorer has lost support and this could be the cause of many of their problems when it comes to logging in and other Salesforce related activities. I want to see if they will still have problems after logging in from a different Internet Browser.\r\n\r\n-------------------------\r\nUpdate: 2/24/2017\r\n-------------------------\r\nI contacted Cesar yesterday to see if there were any problems with logging in, so far no. I'm going to check back next week to see if there were any problems. If not, then I would say that this is completed. \r\n\r\n------------------------\r\nUpdate: 2/27/2017\r\n------------------------\r\nSince they are still having login issues I tested if I used a proxy (different IP address than I actually do) and logged in if I would have a problem. I did have a problem logging in from the netherlands, so I looked at the commonly used IP Addresses of Monterrey and added them to the Network Access Page.\r\n\r\n-------------------------\r\nUpdate: 3/20/2017\r\n-------------------------\r\nRemote Access had another problem yesterday when logging into Salesforce. They had to request access. I checked the IP address to the allowed addresses in Salesforce and added it to the approved address. Next speculation would be that the user's country is indicated as US on Salesforce when really they are logging in from a non-US IP address.\r\n\r\n-------------------------\r\nUpdate: 4/10/2017\r\n-------------------------\r\nIt has been weeks since the last time that Monterrey has had problems with logging in. I will have to say that adding the IP address of the sign-in to the Salesforce list was the solution to the problem.  ","complete":"complete","dateComplete":"2017-04-10"}]