[{"title":"Edit ALL Email Templates to Resemble the Branding","description":"All or at least most of the email templates are not conformed to the current branding. Change them to the current branding. ","dateGiven":"2016-12-08","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"46b80065fc1544bb9d5e1b7bb804dd6f","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-08","comments":"In order for me to change all of the documents to the correct branding. I will need to upgraded in my permissions in Salesforce. This is something that I cannot do so far, so I will wait until I obtain those permissions. \r\n----------------------------------------------------\r\nI've obtained the permissions to work on the email templates. \r\nThe following folders are to be worked in:\r\nUnfiled Public Email Templates - Complete\r\nMy Personal Email Templates - Complete\r\nAccounting - Complete\r\nH2a Emails - Complete\r\nH2A Emails 2016 - Complete\r\nH2A Task Work Flows - Complete\r\nH2B Emails - Complete\r\nH2B Emails 2015 - Complete\r\nLead Emails - Complete\r\nManagement Templates - Complete\r\nMarketing - Complete\r\nOpportunity Emails - Complete\r\nProcessing - Complete\r\nProcessing Other Countries - Complete\r\nRegulation Reminders - Complete\r\nWorkflow Rule Emails - Complete\r\n\r\n-------------------------\r\nUpdate 12/9/2016\r\n-------------------------\r\nSome emails were unable to be edited due to an active component that wasn't safe.\r\nThe following emails had the error:\r\nLead Emails:\r\n- Lead Follow Up Email\r\n- H2B - legal Guest Worker Follow Up\r\n- Lead Follow up Email Not too Late\r\n\r\nProcessing:\r\n- Appointment Request - Jamiaca Access Code\r\n- CSC - Issues with Scheduling (AS & IP)\r\n- CSC - No Permission\r\n- Group Applicant Last_Merge_Text\r\n- Lost and Stolen Travel Document Information\r\n\r\n- Request Appointment. \r\n\r\nI will contact Jarrod and have him look into it. "},{"title":"Follow Up with AT&T","description":"We have a server in the back and we are transitioning to their fiber line; however they left everything untouched currently. Call them up and figure out what is going on. ","dateGiven":"2016-12-14","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"d4fe9d1b15a74e4ea921fea0c4d461ff","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-21","comments":"I have called multiple times.............no answer.\r\n\r\nGoing through the email that Jarrod had sent over to me, I saw that there was a web portal that I could access that would show our current situation. When I accessed it, it stated that we are set for installation on January 10th and testing on January 17th. \r\n\r\nI also sent an email to our AT&T outsourced contact Marty Pais about how unreliable they have been and how their workers were not contacting us ahead of time for installations. \r\n\r\nI have sent all known information to Jarrod, Datavox and ERGOS. \r\n\r\nAny further updates will be sent to Jarrod. \r\n\r\n-----------------------\r\nUpdate: 1/5/2017\r\n-----------------------\r\nMarty Pais has contacted back saying that they would be installing the box that we received a while back today. Then after 5 days they would do a test and turn up on the item as well. \r\n\r\n------------------------\r\nUpdate: 1/25/2017\r\n------------------------\r\nTest and turn up is scheduled for February 2nd. At this point the lines will switch. \r\n\r\n-------------------------\r\nUpdate: 2/9/2017\r\n-------------------------\r\nAfter installation, everything is going well so far. The internet isn't installed yet for the company until after the season when we do more changes on the server and technologically around the office. Arnulfo and Jarrod wanted DID numbers but that wasn't originally included on the changeover due to a possible mixup of communications. I have contacted Marty on the issue and am currently waiting for further notice from him .\r\n\r\n--------------------------\r\nUpdate: 2/14/2017\r\n-------------------------\r\nI emailed Marty again today about the DID numbers. No response yet.\r\n\r\n--------------------------\r\nUpdate: 2/16/2017\r\n--------------------------\r\nI have sent another email to Marty today. \r\n\r\nMarty has responded stating that he has contacted AT&T about it and is awaiting the response. \r\n\r\n--------------------------\r\nUpdate: 2/21/2017\r\n--------------------------\r\nJarrod would like me to email Marty again and include him and Arnulfo on the email by February 23rd.\r\n\r\n--------------------------\r\nUpdate: 2/22/2017\r\n--------------------------\r\nEmailed Marty regarding an update on the order for the DID numbers. \r\n\r\n-------------------------\r\nUpdate: 2/24/2017\r\n-------------------------\r\nGot a response from Marty regarding the new numbers. His response is: \"Still no positive response back from AT&T, requested another follow up this morning.\"\r\n\r\n-------------------------\r\nUpdate: 3/1/2017\r\n-------------------------\r\nEmailed Marty for a status update on the DID Order.\r\n\r\nMarty emailed back within the same day. He stated that AT&T was finally working on the order. They would get with information later today or the next two days.  Currently waiting on the information now.\r\n\r\n-------------------------\r\nUpdate: 3/2/2017\r\n-------------------------\r\nMarty replied back stating that we hit another roadblock. He stated that we already have an order in with AT&T that has yet to be resolved. Since there is an order already in placed that has yet to be resolved, any subsequent orders are placed on hold.\r\nThe order that was already in place was the switch over to the IP Flex which has been completed since February 2nd. \r\n\r\n--------------------------\r\nUpdate: 3/15/2017\r\n--------------------------\r\nI emailed Marty again today to see whether or not there were any updates with the DID number order. \r\n\r\n--------------------------\r\nUpdate: 3/20/2017\r\n--------------------------\r\nEmailed Marty again because I didn't hear from him at all this past week. \r\n\r\n--------------------------\r\nUpdate: 3/21/2017\r\n--------------------------\r\nCalled up AT&T about our account issue that Marty had previously stated and to order the DID number block. I was told that there was no problem with adding another order to the account and that the DID number order would take seconds to go through. Something is really going wrong with the communication between Marty and AT&T and from what Marty tells us as well. I sent Marty another email detailing the phone conversation that I had with the AT&T sales Rep. Jarrod and Arnulfo were included in the email. \r\n\r\n--------------------------\r\nUpdate: 3/29/2017\r\n--------------------------\r\nSent Marty another email for status on the DID numbers. \r\n\r\n--------------------------\r\nUpdate: 4/4/2017\r\n--------------------------\r\nSent Marty another email regarding the request of the status of our DID number order. \r\n\r\nCalled AT&T to see what was going on with our order and to obtain a Business Direct Account so that we can add the DID numbers ourselves. Apparently our Account Manager had switched to a new person without our knowledge and we asked him to get us set up with a Business Direct account. He has taken the needed information and said that we should be able to access the Business Direct within 3-4 business days. \r\n\r\n------------------------\r\nUpdate: 4/7/2017\r\n------------------------\r\nMarty has emailed back stating that everything is now in motion. According to what other AT&T representatives have told me, the process will take roughly 3-4 weeks to be completed. \r\n\r\n-------------------------\r\nUpdate: 4/12/2017\r\n-------------------------\r\nI emailed Marty back asking the length of the process being three or more weeks to complete. \r\n\r\nHe replied back stating that it usually is three or more weeks but he wants to expedite it. \r\n\r\n--------------------------\r\nUpdate: 4/21/2017\r\n--------------------------\r\nI emailed AT&T about the process because I was supposed to hear a follow-up yesterday. They replied back stating that there was a clerical error and that a ticket was put in to correct it. Until then, nothing can be done. \r\n\r\n-------------------------\r\nUpdate: 4/25/2017\r\n-------------------------\r\nEmailed Joebert to see if there was any status on the System error and status of the order. "},{"title":"Migrate Exchange 2010 to Office 365","description":"Email in house currently on server using Exchange 2010, need to migrate to online 365.  Possibly coordinate with new server folks.  ","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"3a5ce8b0a26d44cdaf1b9414289b523e","status":"Waiting on Someone Else","started":"yes","dateStarted":"2016-12-15","comments":"I have contacted both Ron and Ayuba on the project. They will get back to me when they have the invoice completed. \r\n\r\n------------------------\r\nUpdate: 1/12/2017\r\n-------------------------\r\nERGOS has sent a quote on switching to Exchange 365\r\n\r\n-------------------------\r\nUpdate: 2/13/2017\r\n-------------------------\r\nJarrod has responded stating that we wait to switch in case of anything going wrong.","complete":"complete","dateComplete":"2017-01-31","completed":"no"},{"title":"Salesforce Spring '17 Update Write-up","description":"Salesforce Spring '17 Release notes should be out soon. Create a write-up marking down the big updates and hand in for further review. ","dateGiven":"2017-01-13","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"e72c3d9f446e4a1fb246a0c30d136c56","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-02-06","comments":"I have sent a list of topics off to Jarrod and Arnulfo to look over and reply back with the topics that they would want to know more in depth. \r\n\r\n-------------------------\r\nUpdate: 3/2/2017\r\n-------------------------\r\nJarrod stated during one of our meetings that him nor Arnulfo could really understand what the topics were about. He asked for me to narrow it down to what I believed the company would use and to go from there. I finished the write up today and sent it off to Jarrod and Arnulfo for further review. \r\n\r\n"},{"title":"ID Cards","description":"The Zebra ZXP Series 7 is the printer used to print worker IDs. Get it up and running and test to see if it can still print then come back to me for further instruction.","dateGiven":"2017-02-07","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"2cb2773459ed49b788816a393a00d864","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-02-07","comments":"I got the printer up and running. A slight inconvenience is that when printing the cards, they have to be entered manually, but the printer works perfectly. Will have to order more cards. \r\n\r\n---------------------\r\nUpdate: 2/7/2017\r\n------------------------\r\nI ordered 6000 cards from our previous ID card supplier. I will wait until they arrive. \r\n\r\n------------------------\r\nUpdate: 2/13/2017\r\n------------------------\r\nI have received the 6000 cards from ID Supplier and started to work on printing out the ID cards, however, from the cards that were printed, white lines showed across the entire card. They are consistent, and I have contacted Zebra support for further help. They are wanting a repair to the machine and I agree because I have cleaned the card feeder, card path, and the printer head, but still the problems exist. Until the time that I have to send in the machine to get fixed, I am going to be printing the back side of all the cards with the black monochrome ribbon rolls that we have since the lines don't show on the back side.\r\n\r\n-----------------------\r\nUpdate: 2/14/2017\r\n------------------------\r\nI have printed off 5000 back sides to the cards. I asked Arnulfo if we really needed 6000 back sides to be printed because I think that Scott may want to use the extra 1000 cards for other opportunities that may arise. If not, it is simple to print off an extra 1000 backsides. Currently waiting to hear back on what Jarrod and Arnulfo will want to do to get this fixed.\r\n\r\n-------------------------\r\nUpdate: 2/16/2017\r\n-------------------------\r\nScott has approved and given the go ahead on ordering the print head and more ribbons for the printer for me to fix. I have completed the order and they should arrive sometime next week. \r\n\r\n-----------------------------\r\nUpdate: 2/22/2017\r\n-----------------------------\r\nPrint head has been replaced and we got an extra order of the YMCKO ink ribbons. The printer is up to print all the cards and I will start.\r\n\r\nPrinted up to \"Plant Odyssey Inc\" today due to some error on the card printouts.\r\n\r\n-----------------------------\r\nUpdate: 2/23/2017\r\n-----------------------------\r\nPrinted up to \"Chick Landscaping\"\r\n\r\n------------------------------\r\nUpdate: 2/24/2017\r\n---------------------------\r\nPrinted up to \"Landscape Art\" of 2/7/2017\r\n\r\n--------------------------\r\nUpdate: 2/27/2017\r\n--------------------------\r\nPrinted up to 2/13/2017\r\n\r\n-------------------------\r\nUpdate: 2/28/2017\r\n-------------------------\r\nOrdered two more YMCKO ribbons since I have run out of ribbon. Still a lot more IDs to be printed.\r\n\r\n-------------------------\r\nUpdate: 3/6/2017\r\n-------------------------\r\nTwo YMCKO ribbons have come into the mail, I can continue printing more ID cards for the workers. \r\n\r\nLast Printed Account \"Lewis Landscaping and Nursery Inc\" from 2/20/2017\r\n\r\n-------------------------\r\nUpdate: 3/7/2017\r\n-------------------------\r\nPrinting all the Complete status Appointments through 2/22/2017. The next section if riddled with 'Open' Status appointments. I will not print them out until they become complete due to the ID Card button only printing out those with 'Approved' Visa Status. \r\n\r\n-------------------------\r\nUpdate: 3/16/2017\r\n-------------------------\r\nPrinted \"heritage Lawn and Landscape\" on 3/5/2017 appointment date. Skipped over 3/2 appointment date because the items in that section are still 'open'.\r\n\r\n-------------------------\r\nUpdate: 3/17/2017\r\n-------------------------\r\nPrinted through \"BAM Turf Company\" in 3/6/2017. 3/2 is still skipped. \r\n\r\n-------------------------\r\nUpdate: 3/20/2017\r\n-------------------------\r\nPrinted through 3/13/2017. The next couple of sections still have cases open. Waiting until the next section is all completed. \r\n\r\n-------------------------\r\nUpdate: 3/22/2017\r\n-------------------------\r\nPrinted out through \"NorthEast Mesa\" on 3/14/2017\r\n\r\n-------------------------\r\nUpdate: 3/23/3017\r\n-------------------------\r\nPrinted out through \"Montvale Landscaping\" on 3/14/2017 due to open cases still existing in 3/14/2017\r\n\r\n-------------------------\r\nUpdate: 3/27/2017\r\n-------------------------\r\nPrinted through \"Rocky Mountain Custom Landscapes and Associates, Inc\" of 3/21/2017 because the next section still has appointments that are open. \r\nStarting to run low on YMCKO ribbon. Asking for another order to be approved. \r\n\r\n-------------------------\r\nUpdate: 4/4/2017\r\n-------------------------\r\nPrinted out the remaining ID Cards. Waiting on further steps with the ID cards. \r\n\r\n-------------------------\r\nUpdate:4/13/2017\r\n-------------------------\r\nBrandi, Cody and I have arranged to cards in alphabetical order by company name. "},{"title":"Salesforce Sandbox Different Object","description":"Create other objects that would represent as H2A, H2B and EB3 objects instead of just having the H2 Case for all 3. Test this in Sandbox.","dateGiven":"2017-01-13","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"d44911961e644fd88c22a5fdb2b92bee","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-02-10","comments":"Created H2B Case, but any further development requires knowledge that I don't know because of lack of training. \r\nWill Speak to Jarrod about further training. "},{"title":"Conga, Exact Target, Salesforce Webinars/Training","description":"Survey Gizmo Complete Already","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"urgent","_id":"08a229008b074ae4819fc3981c5ad58a","started":"yes","dateStarted":"2016-11-10","comments":"CongaMerge done.\r\nExact Target done. ","status":"Waiting on Someone Else","dateDue":"","complete":"complete","dateComplete":"2017-02-09","completed":"no"},{"title":"Scott's Internet at home","description":"Internet at home office, but not at home.  ","dateGiven":"2016-11-02","givenBy":"jsharp@fewaglobal.org","urgency":"low","_id":"3a779bc4b6314d319a05e8786938111d","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-02-13","comments":"Scott suggested buying a new Wireless Bridge for his home. I did that and it should arrive on Thursday. \r\n\r\n-------------------------\r\nUpdate: 2/16/2017\r\n-------------------------\r\nScott's new Wireless Bridge has come in the mail. \r\n\r\n-------------------------\r\nUpdate: 2/20/2017\r\n-------------------------\r\nAfter installing the new Wireless bridge, we learned that the distance between the two houses that Scott has on his property is a little too far away. The next action to take is for him to contact his current ISP to ask if they can add another 2-in-1 modem on their current line or if they need to have another line in order to get internet in the main house. Scott said to leave the bridge there just in case that when they get the new internet installed, the wireless doesn't reach the entirety of the house. \r\n\r\n-------------------------\r\nUpdate: 3/1/2017\r\n-------------------------\r\nScott has given the Wi-Fi Extender to Arnulfo for use in his office since the Wi-Fi in his room isn't all that good. \r\nI set up the Wi-Fi Extender in Arnulfo's office under the Arnulfo_EXT wireless network access. The passwords have also been added to the password list. \r\n","dateDue":""},{"title":"Add Invoicing Capabilities onto the Worker Object","description":"Add the ability to invoice for the H4 (Visa Fee for 190 and Membership Plus 110) to the Worker object. ","dateGiven":"2017-03-30","dateDue":"","givenBy":"jsharp@fewaglobal.org","urgency":"normal","_id":"7f6854cb42b54df1ade031b5f58cfbe5","status":"Waiting on Someone Else","started":"yes","dateStarted":"2017-03-30","comments":"-------------------------\r\nUpdate: 3/31/2017\r\n-------------------------\r\nI have created multiple new custom fields on the Invoice object in the Sandbox that would help with the new Page layout. The following items have been added: \r\n\r\nCustom Fields\r\n---------------------\r\nL1 - Line Quantity\r\nL1 - Line Total\r\nL2 - Line Quantity\r\nL2 - Line Total\r\nL3 - Line Quantity\r\nL3 - Line Total\r\nL4 - Line Quantity\r\nL4 - Line Total\r\nL5 - Line Quantity\r\nL5 - Line Total\r\nInvoice Total \r\n\r\nPage Layout\r\n------------------\r\nWM Plus Invoice\r\n\r\nRecord Type\r\n-----------------\r\nWorker Member Plus Dues\r\n\r\nI also added two new Worker Member Dues: \r\nWM/Dependent - Visa Fee - 190\r\nWM - Membership Plus - 110\r\n\r\nI have sent off a version of the invoice to Jarrod and Arnulfo to see what they think of it before bringing it over to the Production. Arnulfo stated that it was correct. Waiting on Jarrod's approval.\r\n\r\nJarrod has given me his approval. I will bring this over to production on the next work day and work on the .pdf file that is used in the congamerge since it is only able to be used in Production. \r\n\r\n-----------------------------\r\nUpdate: 4/3/2017\r\n-----------------------------\r\nI have brought over all the newly created fields over to production and also created a new CongaMerge template just for the Create Invoice for WMPlus. During this process of moving items from Sandbox to Production, I had Cody look over at everything that I was doing and asking him questions along the way based on the code and logical troubleshooting. \r\n\r\n-------------------------------\r\nUpdate: 4/5/2017\r\n-----------------------------\r\nJarrod and Arnulfo would like to try to do the dependent object that has its own reporting. Cody and I are going to be working on that in the Sandbox first to see if it works. \r\n\r\n------------------------------\r\nUpdate: 4/6/2017\r\n------------------------------\r\nCody and I added the dependent object and created a record type and page layout for both the appointment and appointment worker object for the reporting abilities. We also created report types to see if the reporting would come out as planned. \r\n\r\n----------------------------\r\nUpdate: 4/10/2017\r\n----------------------------\r\nCody and I have duplicated the Appointment Group 1 and Appointment Worker Worker record types and changed them to Group 7 and Dependent Record types as to differentiate the new fields from the old in the Sandbox so that the invoicing and reporting can work amongst the Dependent object and everything can roll up to the account. \r\n\r\nSome things that don't work anymore on said fields are the workflow rules and the validation rules. All workflow rules and validation rules can be recreated, but currently we don't know what Jarrod will ultimately want on the validation and workflow setup. The 'workers approved' fields were changed on the dependent record type so they do not roll up to the account appointment object anymore. This could be a problem for quick checking any information.  \r\n\r\nWe are currently waiting for a weekly meeting afterstay to go over everything that we've done on the sandbox to see if it what they would like. \r\n\r\n----------------------------\r\nUpdate: 4/21/2017\r\n---------------------------\r\nCody and I showed Jarrod what has been currently been done. The things that he disliked was the tracking of the appointment under the related lists for appointments. Ways to fix that would be to create a new appointment object just for dependents and have it tracked a different way.\r\n\r\nArnulfo and Jarrod are not ready for the creations to come to production until there is more H4 interest. "}]